vsfteam/vsf-all-in-one/source/hal/driver/Artery/AT32F402_405/common/vendor/project/at_start_f402/examples/qspi/command_port_using_dma_and_pem/src/main.c
/**
  **************************************************************************
  * @file     main.c
  * @brief    main program
  **************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

#include "at32f402_405_board.h"
#include "at32f402_405_clock.h"
#include <string.h>

/** @addtogroup AT32F402_periph_examples
  * @{
  */

/** @addtogroup 402_QSPI_command_port_using_dma_and_pem QSPI_command_port_using_dma_and_pem
  * @{
  */

extern void qspi_data_read(uint32_t addr, uint32_t total_len, uint8_t* buf);
extern void qspi_data_write(uint32_t addr, uint32_t total_len, uint8_t* buf);
extern void qspi_erase(uint32_t sec_addr);

#define TEST_SIZE                        4096
/* use dma transmit must align at word */
#if defined ( __ICCARM__ ) /* iar compiler */
  #pragma data_alignment=4
#endif
ALIGNED_HEAD uint8_t wbuf[TEST_SIZE] ALIGNED_TAIL;

#if defined ( __ICCARM__ ) /* iar compiler */
  #pragma data_alignment=4
#endif
ALIGNED_HEAD uint8_t rbuf[TEST_SIZE] ALIGNED_TAIL;

/**
  * @brief  qspi config
  * @param  none
  * @retval none
  */
void qspi_config(void)
{
  gpio_init_type gpio_init_struct;
  /* enable the dma clock */
  crm_periph_clock_enable(CRM_DMA2_PERIPH_CLOCK, TRUE);

  /* enable the qspi clock */
  crm_periph_clock_enable(CRM_QSPI1_PERIPH_CLOCK, TRUE);

  /* enable the pin clock */
  crm_periph_clock_enable(CRM_GPIOB_PERIPH_CLOCK, TRUE);
  crm_periph_clock_enable(CRM_GPIOC_PERIPH_CLOCK, TRUE);

  /* set default parameter */
  gpio_default_para_init(&gpio_init_struct);

  /* configure the io0 gpio */
  gpio_init_struct.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
  gpio_init_struct.gpio_out_type  = GPIO_OUTPUT_PUSH_PULL;
  gpio_init_struct.gpio_mode = GPIO_MODE_MUX;
  gpio_init_struct.gpio_pins = GPIO_PINS_9;
  gpio_init_struct.gpio_pull = GPIO_PULL_NONE;
  gpio_init(GPIOC, &gpio_init_struct);
  gpio_pin_mux_config(GPIOC, GPIO_PINS_SOURCE9, GPIO_MUX_11);

  /* configure the io1 gpio */
  gpio_init_struct.gpio_pins = GPIO_PINS_7;
  gpio_init(GPIOB, &gpio_init_struct);
  gpio_pin_mux_config(GPIOB, GPIO_PINS_SOURCE7, GPIO_MUX_11);

  /* configure the io2 gpio */
  gpio_init_struct.gpio_pins = GPIO_PINS_8;
  gpio_init(GPIOC, &gpio_init_struct);
  gpio_pin_mux_config(GPIOC, GPIO_PINS_SOURCE8, GPIO_MUX_11);

  /* configure the io3 gpio */
  gpio_init_struct.gpio_pins = GPIO_PINS_5;
  gpio_init(GPIOC, &gpio_init_struct);
  gpio_pin_mux_config(GPIOC, GPIO_PINS_SOURCE5, GPIO_MUX_11);

  /* configure the sck gpio */
  gpio_init_struct.gpio_pins = GPIO_PINS_2;
  gpio_init(GPIOB, &gpio_init_struct);
  gpio_pin_mux_config(GPIOB, GPIO_PINS_SOURCE2, GPIO_MUX_11);

  /* configure the cs gpio */
  gpio_init_struct.gpio_pins = GPIO_PINS_11;
  gpio_init(GPIOC, &gpio_init_struct);
  gpio_pin_mux_config(GPIOC, GPIO_PINS_SOURCE11, GPIO_MUX_11);
}

/**
  * @brief  main function.
  * @param  none
  * @retval none
  */
int main(void)
{
  uint16_t i, err = 0;

  system_clock_config();
  at32_board_init();

  for(i = 0; i < TEST_SIZE; i++)
  {
    wbuf[i] = (uint8_t)i;
    rbuf[i] = 0;
  }
  /* qspi config */
  qspi_config();

  /* switch to cmd port */
  qspi_xip_enable(QSPI1, FALSE);

  /* set sclk */
  qspi_clk_division_set(QSPI1, QSPI_CLK_DIV_4);

  /* set sck idle mode 0 */
  qspi_sck_mode_set(QSPI1, QSPI_SCK_MODE_0);

  /* set wip in bit 0 */
  qspi_busy_config(QSPI1, QSPI_BUSY_OFFSET_0);

  /* enable auto ispc */
  qspi_auto_ispc_enable(QSPI1);

  /* erase */
  qspi_erase(0);

  /* read */
  qspi_data_read(0, TEST_SIZE, rbuf);

  for(i = 0; i < TEST_SIZE; i++)
  {
    if(rbuf[i] != 0xFF)
    {
      err = 1;
      break;
    }
  }

  /* program */
  qspi_data_write(0, TEST_SIZE, wbuf);

  /* read */
  qspi_data_read(0, TEST_SIZE, rbuf);

  if(memcmp(rbuf, wbuf, TEST_SIZE))
  {
    err = 1;
  }

  while(1)
  {
    if(err == 0)
    {
      at32_led_toggle(LED3);
      delay_ms(300);
    }
    else
    {
      at32_led_toggle(LED2);
      delay_ms(300);
    }
  }
}

/**
  * @}
  */

/**
  * @}
  */
